import type { TopCategory } from "./ButtonScroll.types";

export const TOP_CATEGORIES: TopCategory[] = ["종류", "계절", "소재"];

export const TYPE_CATEGORIES = ["상의", "하의", "한벌 옷", "아우터", "신발", "악세서리", "기타"];

export const TYPE_DETAILS: Record<string, string[]> = {
  상의: [
    "반팔티",
    "긴팔티",
    "니트",
    "맨투맨",
    "후드티",
    "조끼",
    "슬리브리스",
    "블라우스",
    "트레이닝",
    "탱크탑",
    "크롭탑",
    "기타",
  ],
  하의: ["청바지", "슬랙스", "면바지", "반바지", "치마", "트레이닝", "레깅스", "기타"],
  한벌옷: ["원피스", "점프수트", "기타"],
  아우터: [
    "자켓",
    "가디건",
    "코트",
    "패딩",
    "후드집업",
    "바람막이",
    "블루종",
    "무스탕",
    "베스트",
    "야상",
    "기타",
  ],
  신발: [
    "운동화",
    "스니커즈",
    "샌들",
    "슬리퍼",
    "부츠",
    "하이힐",
    "더비슈즈",
    "로퍼",
    "모카신",
    "등산화",
    "기타",
  ],
  악세서리: [
    "모자",
    "가방",
    "머플러",
    "벨트",
    "반지",
    "팔찌",
    "목걸이",
    "시계",
    "안경",
    "넥타이",
    "귀걸이",
    "기타",
  ],
};

export const SEASONS = ["봄", "여름", "가을", "겨울"];

export const MATERIALS = [
  "데님",
  "면",
  "나일론",
  "폴리에스터",
  "가죽",
  "캐시미어",
  "울",
  "린넨",
  "기타",
];
